nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
max_channels: 1024

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, stem, [32, 'ReLU6']]             # 0-P1/2
  - [-1, 1, MBConvBlock, [16, 3, 1, 1, 0]]   # 1
  - [-1, 1, MBConvBlock, [24, 3, 2, 6, 0.028, True]]   # 2-P2/4
  - [-1, 1, MBConvBlock, [24, 3, 1, 6, 0.057]]
  - [-1, 1, MBConvBlock, [40, 5, 2, 6, 0.085]]   # 4-P3/8
  - [-1, 1, MBConvBlock, [40, 5, 1, 6, 0.114]]
  - [-1, 1, Conv, [256, 1, 1]]  # 123
  - [-2, 1, MBConvBlock, [80, 3, 2, 6, 0.142]]   # 7-P4/16
  - [-1, 1, MBConvBlock, [80, 3, 1, 6, 0.171]]
  - [-1, 1, MBConvBlock, [80, 3, 1, 6, 0.200]]
  - [-1, 1, MBConvBlock, [112, 5, 1, 6, 0.228]]  # 10
  - [-1, 1, MBConvBlock, [112, 5, 1, 6, 0.257]]
  - [-1, 1, MBConvBlock, [112, 5, 1, 6, 0.285]]   # 123
  - [-1, 1, Conv, [512, 1, 1]]
  - [-2, 1, MBConvBlock, [192, 5, 2, 6, 0.314]]  # 14-P5/32
  - [-1, 1, MBConvBlock, [192, 5, 1, 6, 0.342]]
  - [-1, 1, MBConvBlock, [192, 5, 1, 6, 0.371]]
  - [-1, 1, MBConvBlock, [192, 5, 1, 6, 0.400]]
  - [-1, 1, MBConvBlock, [320, 3, 1, 6, 0.428]]  # 18
  - [-1, 1, ScConv, []]  # 括号里空着就行

# YOLOv8.0n head
head:
  - [-1, 1, Conv, [512, 1, 1]]  # 123
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 20
  - [[-1, 13], 1, BiFPN_Add2, [128, 128]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 22 # 123

  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, BiFPN_Add2, [64, 64]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 26 (P3/8-small)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 23, 13], 1, BiFPN_Add3, [128, 128]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 29 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 20], 1, BiFPN_Add2, [128, 128]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 32 (P5/32-large)

  - [[27, 30, 33], 1, Detect, [nc]]  # Detect(P3, P4, P5)

